LiteEMF/ch32f103/user/emf_ch32fxxx_hal/usb/hal_usbd_ch32dev.c
/*
 *   BSD 2-Clause License
 *   Copyright (c) 2022, LiteEMF
 *   All rights reserved.
 *   This software component is licensed by LiteEMF under BSD 2-Clause license,
 *   the "License"; You may not use this file except in compliance with the
 *   License. You may obtain a copy of the License at:
 *       opensource.org/licenses/BSD-2-Clause
 *
 */

/************************************************************************************************************
**	Description:
************************************************************************************************************/
#include "usb/hal_usbd.h"
#if (BIT(1) == API_USBD_BIT_ENABLE)     

#define USBD_ID         1

#include "api/usb/device/usbd.h"
#include "api/usb/usb_typedef.h"
#include "api/api_tick.h"
#include "hw_config.h"

#include "usb_lib.h"
#include "ch32f10x.h"

#include "api/api_log.h"




/******************************************************************************************************
** Defined
*******************************************************************************************************/
#define Fullspeed

#define USBD_ENDP_SIZE			64

/* Buffer Description Table */
/* buffer table base address */
/* buffer table base address */
#define BTABLE_ADDRESS      (0x00)

/* EP0  */
/* rx/tx buffer base address */
#define ENDP0_RXADDR        (0x40)
#define ENDP0_TXADDR        (0x80)


/* ISTR events */
/* IMR_MSK */
/* mask defining which events has to be handled */
/* by the device application software */
#define IMR_MSK (CNTR_CTRM  | CNTR_WKUPM | CNTR_SUSPM | CNTR_ERRM  | CNTR_SOFM \
                 | CNTR_ESOFM | CNTR_RESETM )


/******************************************************************************************************
**	public Parameters
*******************************************************************************************************/

/******************************************************************************************************
**	static Parameters
*******************************************************************************************************/
typedef enum _RESUME_STATE
{
  RESUME_EXTERNAL,
  RESUME_INTERNAL,
  RESUME_LATER,
  RESUME_WAIT,
  RESUME_START,
  RESUME_ON,
  RESUME_OFF,
  RESUME_ESOF
} RESUME_STATE;
struct
{
  __IO RESUME_STATE eState;
  __IO uint8_t bESOFcnt;
}ResumeS;


uint16_t  wInterrupt_Mask;
__IO bool fSuspendEnabled = true;  
__IO uint32_t remotewakeupon=0;

uint16_t Ep0RxBlks;
/* Private variables */
__IO uint16_t wIstr;  
__IO uint8_t bIntPackSOF = 0;  
__IO uint32_t esof_counter =0;
__IO uint32_t wCNTR=0;

volatile uint16_t 	usb_dma_address;            //max512 
/*****************************************************************************************************
**	static Function
******************************************************************************************************/

/*********************************************************************
 * @fn      Set_USBConfig
 *
 * @brief   Set_USBConfig.
 *
 * @return  none
 */
void Set_USBConfig()
{
  if (SystemCoreClock == 72000000) {
      RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_1Div5);
  } else if (SystemCoreClock == 48000000) {
      RCC_USBCLKConfig(RCC_USBCLKSource_PLLCLK_Div1);
  }
  RCC_APB1PeriphClockCmd(RCC_APB1Periph_USB, ENABLE);
}

/*********************************************************************
 * @fn      USB_Interrupts_Config
 *
 * @brief   Configrate USB interrupt.
 *
 * @return  none
 */
void USB_Interrupts_Config(void)
{
  NVIC_InitTypeDef NVIC_InitStructure;
  EXTI_InitTypeDef EXTI_InitStructure;

  EXTI_ClearITPendingBit(EXTI_Line18);
  EXTI_InitStructure.EXTI_Line = EXTI_Line18;
  EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
  EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Rising_Falling;
  EXTI_InitStructure.EXTI_LineCmd = ENABLE;
  EXTI_Init(&EXTI_InitStructure);

  NVIC_InitStructure.NVIC_IRQChannel = USB_LP_CAN1_RX0_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
  NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
  NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
  NVIC_Init(&NVIC_InitStructure);

  NVIC_InitStructure.NVIC_IRQChannel = USBWakeUp_IRQn;
  NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0;
  NVIC_Init(&NVIC_InitStructure);
}

/*********************************************************************
 * @fn      USB_Port_Set
 *
 * @brief   Set USB IO port.
 *
 * @param   NewState - DISABLE or ENABLE.
 *          Pin_In_IPU - Enables or Disables intenal pull-up resistance.
 *
 * @return  none
 */
void USB_Port_Set(FunctionalState NewState, FunctionalState Pin_In_IPU)
{
  RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);

  if (NewState) {
      _SetCNTR(_GetCNTR() & (~(1 << 1)));
      GPIOA->CFGHR &= 0XFFF00FFF;
      GPIOA->OUTDR &= ~(3 << 11); // PA11/12=0
      GPIOA->CFGHR |= 0X00088000; // IPD
  } else {
      _SetCNTR(_GetCNTR() | (1 << 1));
      GPIOA->CFGHR &= 0XFFF00FFF;
      GPIOA->OUTDR &= ~(3 << 11); // PA11/12=0
      GPIOA->CFGHR |= 0X00033000; // LOW
  }

  if (Pin_In_IPU)
      (EXTEN->EXTEN_CTR) |= EXTEN_USBD_PU_EN;
  else
      (EXTEN->EXTEN_CTR) &= ~EXTEN_USBD_PU_EN;
}

/*********************************************************************
 * @fn      USB_SIL_Init
 *
 * @brief   Initialize the USB Device IP and the Endpoint 0.
 *
 * @return  Status.
 */
uint32_t USB_SIL_Init(void)
{
  _SetISTR(0);
  wInterrupt_Mask = IMR_MSK;
  _SetCNTR(wInterrupt_Mask);
	
  return 0;
}



    /*********************************************************************
 * @fn      SetDeviceAddress..
 *
 * @brief   Set the device and all the used Endpoints addresses.
 *
 * @param   Val: device address.
 *
 * @return  none
 */	
void SetDeviceAddress(uint8_t Val)
{
  uint32_t i;

  for (i = 0; i < USBD_ENDP_NUM; i++)
  {
    _SetEPAddress((uint8_t)i, (uint8_t)i);
  } 
	
  _SetDADDR(Val | DADDR_EF); 
}

/*********************************************************************
 * @fn      Enter_LowPowerMode
 *
 * @brief   Enter low power mode.
 *
 * @return  none
 */
void Enter_LowPowerMode(void)
{
  printf("usb enter low power mode\r\n");
}

