LiteEMF/ch32f103/user/emf_ch32fxxx_hal/usb/hal_usbd_ch32dev.c
/*******************************************************************************
 * Function Name  : PowerOn
 * Description    : Enable power on.
 * Input          : None.
 * Return         : USB_SUCCESS.
 *******************************************************************************/
bool PowerOn(void)
{
  uint16_t wRegVal;

  wRegVal = CNTR_FRES;
  _SetCNTR(wRegVal);
  wInterrupt_Mask = 0;
  _SetCNTR(wInterrupt_Mask);
  _SetISTR(0);
  wInterrupt_Mask = CNTR_RESETM | CNTR_SUSPM | CNTR_WKUPM;
  _SetCNTR(wInterrupt_Mask);

  return true;
}

/*******************************************************************************
 * Function Name  : PowerOff
 * Description    : handles switch-off conditions
 * Input          : None.
 * Return         : USB_SUCCESS.
 *******************************************************************************/
bool PowerOff()
{
  _SetCNTR(CNTR_FRES);
  _SetISTR(0);
  _SetCNTR(CNTR_FRES + CNTR_PDWN);

  return true;
}

/*******************************************************************************
 * Function Name  : Suspend
 * Description    : sets suspend mode operating conditions
 * Input          : None.
 * Return         : USB_SUCCESS.
 *******************************************************************************/
void Suspend(void)
{
    __IO uint32_t EP[8];
    uint32_t i = 0;
    uint16_t wCNTR;
    __IO uint32_t savePWR_CR = 0;

    wCNTR = _GetCNTR();
    for (i = 0; i < 8; i++)
        EP[i] = _GetENDPOINT(i);

    wCNTR |= CNTR_RESETM;
    _SetCNTR(wCNTR);

    wCNTR |= CNTR_FRES;
    _SetCNTR(wCNTR);

    wCNTR &= ~CNTR_FRES;
    _SetCNTR(wCNTR);

    while ((_GetISTR() & ISTR_RESET) == 0)
        ;

    _SetISTR((uint16_t)CLR_RESET);

    for (i = 0; i < 8; i++)
        _SetENDPOINT(i, EP[i]);

    wCNTR |= CNTR_FSUSP;
    _SetCNTR(wCNTR);

    wCNTR = _GetCNTR();
    wCNTR |= CNTR_LPMODE;
    _SetCNTR(wCNTR);

    Enter_LowPowerMode();
}

/*******************************************************************************
 * Function Name  : Resume_Init
 * Description    : Handles wake-up restoring normal operations
 * Input          : None.
 * Return         : USB_SUCCESS.
 *******************************************************************************/
void Resume_Init(void)
{
    uint16_t wCNTR;

    wCNTR = _GetCNTR();
    wCNTR &= (~CNTR_LPMODE);
    _SetCNTR(wCNTR);
    _SetCNTR(IMR_MSK);
}

/*******************************************************************************
 * Function Name  : Resume
 * Description    : This is the state machine handling resume operations and
 *                 timing sequence. The control is based on the Resume structure
 *                 variables and on the ESOF interrupt calling this subroutine
 *                 without changing machine state.
 * Input          : a state machine value (RESUME_STATE)
 *                  RESUME_ESOF doesn't change ResumeS.eState allowing
 *                  decrementing of the ESOF counter in different states.
 * Return         : None.
 *******************************************************************************/
void Resume(RESUME_STATE eResumeSetVal)
{
    uint16_t wCNTR;

    if (eResumeSetVal != RESUME_ESOF) {
        ResumeS.eState = eResumeSetVal;
    }

    switch (ResumeS.eState) {
    case RESUME_EXTERNAL:
        if (remotewakeupon == 0) {
            Resume_Init();
            ResumeS.eState = RESUME_OFF;
        } else {
            ResumeS.eState = RESUME_ON;
        }
        break;

    case RESUME_INTERNAL:
        Resume_Init();
        ResumeS.eState = RESUME_START;
        remotewakeupon = 1;
        break;

    case RESUME_LATER:
        ResumeS.bESOFcnt = 2;
        ResumeS.eState = RESUME_WAIT;
        break;

    case RESUME_WAIT:
        ResumeS.bESOFcnt--;
        if (ResumeS.bESOFcnt == 0)
            ResumeS.eState = RESUME_START;
        break;

    case RESUME_START:
        wCNTR = _GetCNTR();
        wCNTR |= CNTR_RESUME;
        _SetCNTR(wCNTR);
        ResumeS.eState = RESUME_ON;
        ResumeS.bESOFcnt = 10;
        break;

    case RESUME_ON:
        ResumeS.bESOFcnt--;
        if (ResumeS.bESOFcnt == 0) {
            wCNTR = _GetCNTR();
            wCNTR &= (~CNTR_RESUME);
            _SetCNTR(wCNTR);
            ResumeS.eState = RESUME_OFF;
            remotewakeupon = 0;
        }
        break;

    case RESUME_OFF:

    case RESUME_ESOF:

    default:
        ResumeS.eState = RESUME_OFF;
        break;
    }
}

/*******************************************************************************
 * Function Name  : CTR_LP.
 * Description    : Low priority Endpoint Correct Transfer interrupt's service
 *                  routine.
 * Input          : None.
 * Return         : None.
 *******************************************************************************/
void CTR_LP(void)
{
    __IO uint16_t wIstr;
    __IO uint16_t wEPVal = 0;
    __IO uint16_t len;
    __IO uint8_t EPindex;

    while (((wIstr = _GetISTR()) & ISTR_CTR) != 0) {
        EPindex = (uint8_t)(wIstr & ISTR_EP_ID);

        if (EPindex == 0) {
            _SetEPRxTxStatus(ENDP0, EP_RX_NAK, EP_TX_NAK);
			
            if ((wIstr & ISTR_DIR) == 0){ // IN
                _ClearEP_CTR_TX(ENDP0);
                usbd_endp_in_event(USBD_ID, TUSB_DIR_IN_MASK | EPindex);
                // SetEPRxCount(ENDP0, USBD_ENDP0_MTU);
                return;
            } else {
                wEPVal = _GetENDPOINT(ENDP0);

                if ((wEPVal & EP_SETUP) != 0){  // EP_SETUP
                    usb_control_request_t req;
                    
                    _ClearEP_CTR_RX(ENDP0);
                    PMAToUserBufferCopy((uint8_t*)&req, GetEPRxAddr(ENDP0), 8);
                    usbd_setup_event(USBD_ID, &req , sizeof(usb_control_request_t));
                    return;
                } else if ((wEPVal & EP_CTR_RX) != 0){ // out
                    _ClearEP_CTR_RX(ENDP0);
                    len = GetEPRxCount(0);
                    usbd_endp_out_event(USBD_ID, EPindex, len);
                    return;
                } else {
                    wEPVal = _GetENDPOINT(ENDP0);
                    logd("i %x %x\n", wIstr, wEPVal);
                }
            }
        } else {
            wEPVal = _GetENDPOINT(EPindex);
            if ((wEPVal & EP_CTR_RX) != 0) {            //endp rx isr
                len = GetEPRxCount(EPindex);
                usbd_endp_out_event(USBD_ID, EPindex, len);
                _ClearEP_CTR_RX(EPindex);
            }

            if ((wEPVal & EP_CTR_TX) != 0) {           //endp tx isr
                usbd_endp_in_event(USBD_ID, TUSB_DIR_IN_MASK | EPindex);
                _ClearEP_CTR_TX(EPindex);
            }
        }
    }
}

/*********************************************************************
 * @fn      USB_Istr
 *
 * @brief   ISTR events interrupt service routine
 *
 * @return  none
 */
void USB_Istr(void)
{
    uint32_t i = 0;
    __IO uint32_t EP[8];

