LiteEMF/ch32f103/user/emf_ch32fxxx_hal/usb/hal_usbd_ch32dev.c
    if ((*_pEPRxCount(0) & 0xFC00) != Ep0RxBlks) {
        *_pEPRxCount(0) |= (Ep0RxBlks & 0xFC00);
    }
    wIstr = _GetISTR();
    #if (IMR_MSK & ISTR_SOF)
    if (wIstr & ISTR_SOF & wInterrupt_Mask) {
        _SetISTR((uint16_t)CLR_SOF);
        bIntPackSOF++;

        #ifdef SOF_CALLBACK
        SOF_Callback();
        #endif
    }
    #endif

    #if (IMR_MSK & ISTR_CTR)
    if (wIstr & ISTR_CTR & wInterrupt_Mask) {
        CTR_LP();
    #ifdef CTR_CALLBACK
        CTR_Callback();
    #endif
    }
    #endif

    #if (IMR_MSK & ISTR_RESET)
    if (wIstr & ISTR_RESET & wInterrupt_Mask) {
        _SetISTR((uint16_t)CLR_RESET);
        usbd_reset_event(USBD_ID);
    #ifdef RESET_CALLBACK
        RESET_Callback();
    #endif
    }
    #endif

    #if (IMR_MSK & ISTR_DOVR)
    if (wIstr & ISTR_DOVR & wInterrupt_Mask) {
        _SetISTR((uint16_t)CLR_DOVR);
    #ifdef DOVR_CALLBACK
        DOVR_Callback();
    #endif
    }
    #endif

    #if (IMR_MSK & ISTR_ERR)
    if (wIstr & ISTR_ERR & wInterrupt_Mask) {
        _SetISTR((uint16_t)CLR_ERR);
    #ifdef ERR_CALLBACK
        ERR_Callback();
    #endif
    }
    #endif

    #if (IMR_MSK & ISTR_WKUP)
    if (wIstr & ISTR_WKUP & wInterrupt_Mask) {
        _SetISTR((uint16_t)CLR_WKUP);
        Resume(RESUME_EXTERNAL);
        #ifdef WKUP_CALLBACK
        WKUP_Callback();
        #endif
    }
    #endif
    #if (IMR_MSK & ISTR_SUSP)
    if (wIstr & ISTR_SUSP & wInterrupt_Mask) {
        if (fSuspendEnabled) {
            Suspend();
        } else {
            Resume(RESUME_LATER);
        }
        _SetISTR((uint16_t)CLR_SUSP);
        #ifdef SUSP_CALLBACK
        SUSP_Callback();
        #endif

        usbd_suspend_event(USBD_ID);
    }
    #endif

    #if (IMR_MSK & ISTR_ESOF)
    if (wIstr & ISTR_ESOF & wInterrupt_Mask) {
        _SetISTR((uint16_t)CLR_ESOF);

        if ((_GetFNR() & FNR_RXDP) != 0) {
            esof_counter++;

            if ((esof_counter > 3) && ((_GetCNTR() & CNTR_FSUSP) == 0)) {

                wCNTR = _GetCNTR();

                for (i = 0; i < 8; i++)
                    EP[i] = _GetENDPOINT(i);

                wCNTR |= CNTR_FRES;
                _SetCNTR(wCNTR);

                wCNTR &= ~CNTR_FRES;
                _SetCNTR(wCNTR);

                while ((_GetISTR() & ISTR_RESET) == 0)
                    ;

                _SetISTR((uint16_t)CLR_RESET);

                for (i = 0; i < 8; i++)
                    _SetENDPOINT(i, EP[i]);

                esof_counter = 0;
            }
        } else {
            esof_counter = 0;
        }

        Resume(RESUME_ESOF);

        #ifdef ESOF_CALLBACK
        ESOF_Callback();
        #endif
    }
    #endif
} /* USB_Istr */


/*********************************************************************
 * @fn      USBWakeUp_IRQHandler
 *
 * @brief   This function handles USB wake up exception.
 *
 * @return  none
 */
void USBWakeUp_IRQHandler(void)
{
    EXTI_ClearITPendingBit(EXTI_Line18);
}

/*********************************************************************
 * @fn      USBWakeUp_IRQHandler
 *
 * @brief   This function handles USB exception.
 *
 * @return  none
 */
void USB_LP_CAN1_RX0_IRQHandler(void)
{
    USB_Istr();
}

/*****************************************************************************************************
**  Function
******************************************************************************************************/

error_t hal_usbd_endp_dma_init(uint8_t id)
{
    usb_dma_address = ENDP0_TXADDR + USBD_ENDP0_MTU;
	return ERROR_SUCCESS;
}

/*******************************************************************
** Parameters:
** Returns:
** Description: 注意: 不要多次打开相同端点
    usbd 使用的是硬件 fifo 最大fifo 512(USB基地址占用了底64byte(没有完全用完)
    因为双缓冲切换缓冲区的管理机制需要用到所有4个缓冲区描述表的表项，
    分别用来表示每个方向上的两个缓冲区的地址指针和缓冲区大小，
	因此用来实现双缓冲批量端点的USB_EpnR寄存器必需配置为单向。
	所以只需要设定STAT_RX位(作为双缓冲批量接收端点)或者STAT_TX位(作为双缓冲批量发送端点)。
	如果需要一个双向的双缓冲批量端点，则须使用两个USB_EpnR寄存器。
	
	同步传送必须是双buf, 所以同步传送一定是单独端点IN/out, 这里不使用音频双buf 设置为同一个buf
*******************************************************************/
error_t hal_usbd_endp_open(uint8_t id, usb_endp_t* pendp)
{
    uint16_t endp_add = usb_dma_address;

    if (USBD_ID != id) return ERROR_FAILE;

    if (0 == pendp->addr) {
        SetBTABLE(BTABLE_ADDRESS);
        SetEPType(ENDP0, EP_CONTROL);
		SetEPTxStatus(ENDP0, EP_TX_STALL);
		SetEPRxAddr(ENDP0, ENDP0_RXADDR);
		SetEPTxAddr(ENDP0, ENDP0_TXADDR);
		Clear_Status_Out(ENDP0);
		SetEPRxCount(ENDP0, USBD_ENDP0_MTU);
		SetEPRxValid(ENDP0);
        _ClearDTOG_RX(ENDP0);
        _ClearDTOG_TX(ENDP0);
        SetDeviceAddress(0);
    }else if (pendp->dir) {
        switch(pendp->type){
            case TUSB_ENDP_TYPE_CTRL:
                SetEPType(pendp->addr, EP_CONTROL);
            break;
            case TUSB_ENDP_TYPE_ISOCH:		//设置为同一个buf
                SetEPType(pendp->addr, EP_ISOCHRONOUS);
                SetEPRxAddr(pendp->addr, endp_add);
                SetEPRxCount(pendp->addr, pendp->mtu);
            break;
            case TUSB_ENDP_TYPE_BULK:
                SetEPType(pendp->addr, EP_BULK);
            break;
            case TUSB_ENDP_TYPE_INTER:
                SetEPType(pendp->addr, EP_INTERRUPT);
            break;
        }
        
        SetEPTxAddr(pendp->addr, endp_add);
        SetEPTxStatus(pendp->addr, EP_TX_NAK);
        _ClearDTOG_TX(pendp->addr);
        endp_add += pendp->mtu;
    } else {
        switch(pendp->type){
            case TUSB_ENDP_TYPE_CTRL:
                SetEPType(pendp->addr, EP_CONTROL);
            break;
            case TUSB_ENDP_TYPE_ISOCH:		//设置为同一个buf
                SetEPType(pendp->addr, EP_ISOCHRONOUS);
                SetEPTxAddr(pendp->addr, endp_add);
            break;
            case TUSB_ENDP_TYPE_BULK:
                SetEPType(pendp->addr, EP_BULK);
            break;
            case TUSB_ENDP_TYPE_INTER:
                SetEPType(pendp->addr, EP_INTERRUPT);
            break;
        }
        
        SetEPRxAddr(pendp->addr, endp_add);
        SetEPRxCount(pendp->addr, pendp->mtu);
        SetEPRxStatus(pendp->addr, EP_RX_VALID);
        _ClearDTOG_RX(pendp->addr);
        SetEPRxValid(pendp->addr);
        endp_add += pendp->mtu;
    }
    usb_dma_address = endp_add;
    logd("set ep%x addr=%x\n", ((uint8_t)pendp->dir << 7) | pendp->addr , usb_dma_address);

    if(usb_dma_address > 512){
        loge_r("usbd endp set over %d\n", usb_dma_address);
    }
    return ERROR_SUCCESS;
}

