LiteEMF/ch32f103/user/emf_ch32fxxx_hal/usb/hal_usbd_ch32dev.c
error_t hal_usbd_endp_close(uint8_t id, uint8_t ep)
{
    uint8_t ep_addr = ep & 0x7f;
    if (USBD_ID != id) return ERROR_FAILE;

    if (0 == ep_addr) return ERROR_FAILE;

    SetEPTxStatus(ep_addr, EP_TX_DIS);
    SetEPRxStatus(ep_addr, EP_RX_DIS);

    return ERROR_SUCCESS;
}


/*******************************************************************************
* Function Name  : 
* Description    : USB设备设置端点STALL
* Input          : endp: 最高位表示输入输出	
* Output         : None
* Return         : None
*******************************************************************************/
error_t hal_usbd_endp_ack(uint8_t id, uint8_t ep, uint16_t len)
{
    uint8_t ep_addr = ep & 0x7f;
    if (USBD_ID != id) return ERROR_FAILE;
   
	if (ep & 0x80){
        SetEPTxCount(ep_addr, len);
	    SetEPTxValid(ep_addr);	
    }else{
        SetEPRxValid(ep_addr);
    }

    return ERROR_SUCCESS;
}

error_t hal_usbd_endp_nak(uint8_t id, uint8_t ep)
{
    uint8_t ep_addr = ep & 0x7f;
    if (USBD_ID != id) return ERROR_FAILE;
   
	if (ep & 0x80){
        _SetEPTxStatus(ep_addr, EP_TX_NAK);
    }else{
        _SetEPRxStatus(ep_addr, EP_RX_NAK);
    }

    return ERROR_SUCCESS;
}


error_t hal_usbd_clear_endp_stall(uint8_t id, uint8_t ep)
{
    uint8_t ep_addr = ep & 0x7f;

    if (USBD_ID != id) return ERROR_FAILE;

    if (ep & 0x80) {
        ClearDTOG_TX(ep_addr);
        _SetEPTxStatus(ep_addr, EP_TX_VALID);
    } else {
        if (0 == ep_addr) {
            SetEPRxCount(ep_addr, USBD_ENDP0_MTU);
            _SetEPRxStatus(ep_addr, EP_RX_VALID);
        } else {
            ClearDTOG_RX(ep_addr);
            _SetEPRxStatus(ep_addr, EP_RX_VALID);
        }
    }

    return ERROR_SUCCESS;
}
error_t hal_usbd_endp_stall(uint8_t id, uint8_t ep)
{
    uint8_t ep_addr = ep & 0x7f;

    if (USBD_ID != id) return ERROR_FAILE;

    if (0 == ep_addr) {
        _SetEPRxTxStatus(ENDP0, EP_RX_STALL, EP_TX_STALL);
    } else {
        if (ep & 0x80) {
            _SetEPTxStatus(ep_addr, EP_TX_STALL);
        } else {
            _SetEPRxStatus(ep_addr, EP_RX_STALL);
        }
    }

    return ERROR_SUCCESS;
}


uint8_t* hal_usbd_get_endp_buffer(uint8_t id, uint8_t ep)
{
    uint8_t ep_addr = ep & 0x7f;
    uint8_t *pbuf = NULL;

    if (USBD_ID != id) return NULL;

    if(0X80 & ep){
        pbuf = (uint8_t *)(GetEPTxAddr(ep_addr) * 2 + PMAAddr);
    }else{
        pbuf = (uint8_t *)(GetEPRxAddr(ep_addr) * 2 + PMAAddr);
    }

    return pbuf;
}



/*******************************************************************
** Parameters:
** Returns:
** Description: 注意: 端点0 发送需要处理usbd_req_t
*******************************************************************/
error_t hal_usbd_in(uint8_t id, uint8_t ep, uint8_t* buf, uint16_t len)
{
    error_t err = ERROR_FAILE;
    uint8_t ep_addr = ep & 0x7f;
    uint16_t send_len;

    if (USBD_ID != id) return ERROR_FAILE;

    if(0 == ep_addr){
        usbd_req_t *preq = usbd_get_req(id);

        if(preq->setup_index <= preq->setup_len){
            send_len = preq->setup_len - preq->setup_index;
            send_len = (send_len >= USBD_ENDP0_MTU) ? USBD_ENDP0_MTU : send_len; //本次传输长度
            UserToPMABufferCopy((void*)(preq->setup_buf+preq->setup_index), GetEPTxAddr(ENDP0), send_len);               //加载上传数据	
            preq->setup_index += send_len;

            err = hal_usbd_endp_ack(id, ep, send_len);

            if(preq->setup_index == preq->setup_len){
                if(USBD_ENDP0_MTU != send_len){             //判断发送最后一包数据
                    usbd_free_setup_buffer(preq);           //发送完成释放内存
                    hal_usbd_endp_ack(id, 0x00, 0);         //设置RX ACK
                }
            }
        }else{
            return ERROR_FAILE;
        }
    }else{

        UserToPMABufferCopy(buf, GetEPTxAddr(ep_addr), len);
        err = hal_usbd_endp_ack(id, ep, len);
    }

    return err;
}

error_t hal_usbd_out(uint8_t id, uint8_t ep, uint8_t* buf, uint16_t* plen)
{
    uint8_t ep_addr = ep & 0x7f;
    if (USBD_ID != id) return ERROR_FAILE;

    if(NULL != buf) PMAToUserBufferCopy(buf, GetEPRxAddr(ep_addr), *plen);
    hal_usbd_endp_ack(id, ep, 0);         //设置RX ACK

    return ERROR_SUCCESS;
}
error_t hal_usbd_reset(uint8_t id)
{
    return hal_usbd_init(id);
}
error_t hal_usbd_set_address(uint8_t id, uint8_t address)
{
    uint32_t i;
    if (USBD_ID != id) return ERROR_FAILE;

    for (i = 0; i < 8; i++){			//必须设置全部地址防止出错
        _SetEPAddress((uint8_t)i, (uint8_t)i);
    } 
	
    _SetDADDR(address | DADDR_EF); 

    return ERROR_SUCCESS;
}



error_t hal_usbd_init(uint8_t id)
{
    uint8_t	i;

    if (USBD_ID != id) return ERROR_FAILE;

    usb_dma_address = ENDP0_TXADDR + USBD_ENDP0_MTU;                    //clear dma address 

    Set_USBConfig();  
    //usb init
    PowerOn();

    for (i=0;i<USBD_ENDP_NUM;i++){
        _SetENDPOINT(i,_GetENDPOINT(i) & 0x7F7F & EPREG_MASK);//all clear
        SetEPTxCount(i,0);		//clean tx len
    }
    _SetISTR((uint16_t)0x00FF);//all clear
    USB_SIL_Init();
    USB_Port_Set(DISABLE, DISABLE);		
	delay_ms(10);
	USB_Port_Set(ENABLE, ENABLE);	
 	USB_Interrupts_Config();  


    return ERROR_SUCCESS;
}
error_t hal_usbd_deinit(uint8_t id)
{
    if (USBD_ID != id) return ERROR_FAILE;

    USB_Port_Set(DISABLE, DISABLE);

    return ERROR_SUCCESS;
}
#endif

